CSI API ETABS v1

# cLoadCasesModalRitz Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cCaseModalRitz ModalRitz { get; }

    ReadOnly Property ModalRitz As cCaseModalRitz
    	Get

    Dim instance As cLoadCases
    Dim value As cCaseModalRitz

    value = instance.ModalRitz

    property cCaseModalRitz^ ModalRitz {
    	cCaseModalRitz^ get ();
    }

    abstract ModalRitz : cCaseModalRitz with get

#### Property Value

Type: cCaseModalRitz

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com